tap "getsentry/tools"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "libsql/sqld"
tap "oven-sh/bun"
tap "tursodatabase/tap"
tap "warrensbox/tap"
# TIFF library and utilities
brew "libtiff"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Next generation open source RPC library and framework
brew "grpc"
# Columnar in-memory analytics layer designed to accelerate big data
brew "apache-arrow"
# Automatic configure script builder
brew "autoconf"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Collection of portable C++ source libraries
brew "boost"
# GNU compiler collection
brew "gcc"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Software library to render fonts
brew "freetype"
# Core application library for C
brew "glib"
# Computational Geometry Algorithms Library
brew "cgal"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Isolated development environments using Docker
brew "docker-compose"
# Text processing system for reStructuredText
brew "docutils"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# Shared library for Watchman and Eden projects
brew "edencommon"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modular, composable client/server abstractions framework
brew "wangle"
# Thrift functions for querying information from a service
brew "fb303"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# Image processing and image analysis library
brew "leptonica"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Blu-Ray disc playback library for media players like VLC
brew "libbluray"
# Optimized BLAS library
brew "openblas"
# Package for scientific computing with Python
brew "numpy"
# Framework for layout and rendering of i18n text
brew "pango"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# Library for encoding and decoding .avif files
brew "libavif"
# Graphics library to dynamically manipulate images
brew "gd"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Library access to GnuPG
brew "gpgme"
# File format designed to store large amounts of data
brew "hdf5"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Pager program similar to more
brew "less"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Generic library support script
brew "libtool"
# GNOME XML library
brew "libxml2"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Fast, highly customisable system info script
brew "neofetch"
# Libraries and data formats for array-oriented scientific data
brew "netcdf"
# Image manipulation
brew "netpbm"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Shell command parallelization utility
brew "parallel"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Theme for zsh
brew "powerlevel10k"
# Cartographic Projections Library
brew "proj"
# Python version management
brew "pyenv"
# Rust toolchain installer
brew "rustup-init"
# Library for loading images as SDL surfaces and textures
brew "sdl2_image"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Plugin manager for tmux
brew "tpm"
# Command-line interface to the freedesktop.org trashcan
brew "trash-cli"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Watch files and take action when they change
brew "watchman"
# Show the current WiFi network password
brew "wifi-password"
# Tool for managing your YubiKey configuration
brew "ykman"
# General-purpose lossless data-compression library
brew "zlib"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Zsh port of Fish shell's history search
brew "zsh-history-substring-search"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Vault
brew "hashicorp/tap/vault"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
brew "tursodatabase/tap/turso"
# The tfswitch command lets you switch between terraform versions.
brew "warrensbox/tap/tfswitch"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Chromium based browser
cask "arc"
# Open-source KVM software
cask "barrier"
# Menu bar icon organiser
cask "bartender"
# Utility improving 3rd party mouse performance and functionalities
cask "bettermouse"
# Multi-platform client-side cloud file encryption tool
cask "cryptomator"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker"
# Free monospaced font with programming ligatures
cask "font-fira-code"
cask "font-input"
# Superfamily of fonts for code
cask "font-monaspace"
# Web browser
cask "google-chrome"
# Tool to optimise images to a smaller size
cask "imageoptim"
# Keyboard customiser
cask "karabiner-elements"
# Blocks all Keyboard and TouchBar input
cask "keyboardcleantool"
# Application to spoof your iOS, iPadOS or iPhoneSimulator device location
cask "locationsimulator"
# Full TeX Live distribution without GUI applications
cask "mactex-no-gui"
# Manage your windows in Mission Control
cask "mission-control-plus"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# App to write, plan, collaborate, and get organised
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Home media server
cask "plex-media-server"
# Used to access context-specific actions when text is selected
cask "popclip"
# VPN client
cask "purevpn"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Control your tools with a few keystrokes
cask "raycast"
# Standalone app for debugging React Native apps
cask "react-native-debugger"
# Collection of apps available by subscription
cask "setapp"
# Screenshot measurement and annotation tool
cask "shottr"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Native GUI tool for relational databases
cask "tableplus"
# Remote access and connectivity software focused on security
cask "teamviewer"
# Web browser focusing on security
cask "tor-browser"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
mas "Affinity Photo 2", id: 1616822987
mas "CleanMyMac X", id: 1339170533
mas "Color Picker", id: 1545870783
mas "DaVinci Resolve", id: 571213070
mas "Dropover", id: 1355679052
mas "GSE SMART IPTV", id: 1293083751
mas "iStat Menus", id: 1319778037
mas "LimeChat", id: 414030210
mas "Magnet", id: 441258766
mas "Microsoft Excel", id: 462058435
mas "Microsoft Remote Desktop", id: 1295203466
mas "NordVPN", id: 905953485
mas "TestFlight", id: 899247664
mas "TextSniper", id: 1528890965
mas "TickTick", id: 966085870
mas "WhatsApp", id: 1147396723
mas "WireGuard", id: 1451685025
mas "Yubico Authenticator", id: 1497506650
vscode "4ops.terraform"
vscode "adpyke.codesnap"
vscode "akil-s.tokyo-light"
vscode "alanwalk.markdown-navigation"
vscode "antfu.where-am-i"
vscode "beatzoid.http-status-codes"
vscode "bradlc.vscode-tailwindcss"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "compulim.vscode-clock"
vscode "dbaeumer.vscode-eslint"
vscode "dotjoshjohnson.xml"
vscode "drcika.apc-extension"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "exodiusstudios.comment-anchors"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gleam.gleam"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.hcl"
vscode "hashicorp.sentinel"
vscode "hashicorp.terraform"
vscode "hoovercj.vscode-settings-cycler"
vscode "humao.rest-client"
vscode "james-yu.latex-workshop"
vscode "jock.svg"
vscode "leafvmaple.nand2tetris"
vscode "loyio.nand2tetris-vscode"
vscode "mgmcdermott.vscode-language-babel"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "million.million-lint"
vscode "moalamri.inline-fold"
vscode "ms-playwright.playwright"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "mylesmurphy.prettify-ts"
vscode "oliversturm.fix-json"
vscode "orta.vscode-twoslash-queries"
vscode "otovo-oss.htmx-tags"
vscode "oven.bun-vscode"
vscode "pkief.material-icon-theme"
vscode "pomber.git-file-history"
vscode "qwtel.sqlite-viewer"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "roblourens.vscode-nand2tetris-hdl"
vscode "rust-lang.rust-analyzer"
vscode "ryuta46.multi-command"
vscode "serayuzgur.crates"
vscode "statelyai.stately-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "supermaven.supermaven"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vintharas.learn-vim"
vscode "vitest.explorer"
vscode "vscodevim.vim"
vscode "vsls-contrib.gistfs"
vscode "wayou.vscode-todo-highlight"
vscode "william-voyek.vscode-nginx"
vscode "xaver.clang-format"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
