tap "getsentry/tools"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "libsql/sqld"
tap "oven-sh/bun"
tap "tursodatabase/tap"
tap "warrensbox/tap"

brew "docker-compose"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Library access to GnuPG
brew "gpgme"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Mac App Store command-line interface
brew "mas"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Shell command parallelization utility
brew "parallel"
# Rust toolchain installer
brew "rustup-init"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Watch files and take action when they change
brew "watchman"
# Tool for managing your YubiKey configuration
brew "ykman"
# General-purpose lossless data-compression library
brew "zlib"
# Vault
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "tursodatabase/tap/turso"
# The tfswitch command lets you switch between terraform versions.
cask "aldente"
# Open-source KVM software
cask "barrier"
# Menu bar icon organiser
cask "bartender"
# Utility improving 3rd party mouse performance and functionalities
cask "bettermouse"
# Multi-platform client-side cloud file encryption tool
cask "cryptomator"
# App to build and share containerised applications and microservices
cask "docker"
# Free monospaced font with programming ligatures
cask "imageoptim"
# Keyboard customiser
cask "karabiner-elements"
# Blocks all Keyboard and TouchBar input
cask "keyboardcleantool"
# Application to spoof your iOS, iPadOS or iPhoneSimulator device location
cask "locationsimulator"
# Full TeX Live distribution without GUI applications
cask "mactex-no-gui"
# Manage your windows in Mission Control
cask "mission-control-plus"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Home media server
cask "plex-media-server"
# Used to access context-specific actions when text is selected
cask "popclip"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Collection of apps available by subscription
cask "setapp"
# Screenshot measurement and annotation tool
cask "shottr"
# Video game digital distribution service
cask "steam"
# Native GUI tool for relational databases
cask "tableplus"
# Remote access and connectivity software focused on security
cask "teamviewer"
# Web browser focusing on security
cask "tor-browser"
mas "Affinity Photo 2", id: 1616822987
mas "CleanMyMac X", id: 1339170533
mas "Color Picker", id: 1545870783
mas "DaVinci Resolve", id: 571213070
mas "Dropover", id: 1355679052
mas "GSE SMART IPTV", id: 1293083751
mas "iStat Menus", id: 1319778037
mas "LimeChat", id: 414030210
mas "Magnet", id: 441258766
mas "Microsoft Excel", id: 462058435
mas "Microsoft Remote Desktop", id: 1295203466
mas "NordVPN", id: 905953485
mas "TestFlight", id: 899247664
mas "TextSniper", id: 1528890965
mas "TickTick", id: 966085870
mas "WhatsApp", id: 1147396723
mas "WireGuard", id: 1451685025
mas "Yubico Authenticator", id: 1497506650
vscode "4ops.terraform"
vscode "adpyke.codesnap"
vscode "akil-s.tokyo-light"
vscode "alanwalk.markdown-navigation"
vscode "antfu.where-am-i"
vscode "beatzoid.http-status-codes"
vscode "bradlc.vscode-tailwindcss"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "compulim.vscode-clock"
vscode "dbaeumer.vscode-eslint"
vscode "dotjoshjohnson.xml"
vscode "drcika.apc-extension"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "exodiusstudios.comment-anchors"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gleam.gleam"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.hcl"
vscode "hashicorp.sentinel"
vscode "hashicorp.terraform"
vscode "hoovercj.vscode-settings-cycler"
vscode "humao.rest-client"
vscode "james-yu.latex-workshop"
vscode "jock.svg"
vscode "leafvmaple.nand2tetris"
vscode "loyio.nand2tetris-vscode"
vscode "mgmcdermott.vscode-language-babel"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "million.million-lint"
vscode "moalamri.inline-fold"
vscode "ms-playwright.playwright"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "mylesmurphy.prettify-ts"
vscode "oliversturm.fix-json"
vscode "orta.vscode-twoslash-queries"
vscode "otovo-oss.htmx-tags"
vscode "oven.bun-vscode"
vscode "pkief.material-icon-theme"
vscode "pomber.git-file-history"
vscode "qwtel.sqlite-viewer"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "roblourens.vscode-nand2tetris-hdl"
vscode "rust-lang.rust-analyzer"
vscode "ryuta46.multi-command"
vscode "serayuzgur.crates"
vscode "statelyai.stately-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "supermaven.supermaven"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vintharas.learn-vim"
vscode "vitest.explorer"
vscode "vscodevim.vim"
vscode "vsls-contrib.gistfs"
vscode "wayou.vscode-todo-highlight"
vscode "william-voyek.vscode-nginx"
vscode "xaver.clang-format"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
